'''
Цель работы: исследование структуры асимметричного алгоритма шифрования: DSA.
Задания:
1. Реализовать асимметричный алгоритм шифрования: DSA.
2. Реализовать разработанный алгоритм на Python.
Методика выполнения практической работы. Выбрать один из алгоритмов симметричного шифрования, изучить алгоритм его работы и реализовать на каком-либо языке программирования. Требования к работе:
- программа шифрования должна быть наделена понятным и удобным пользовательским интерфейсом;
- полная реализация выбранного алгоритма;
- запрещено использование любых сторонних библиотек.
'''